blogs/linux-command.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>linux命令备忘</title>
<!-- 2016-05-05 四 19:09 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="root" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">linux命令备忘</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> java 工具</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 将汉字编码为utf8</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-bash"># echo -n "善良" | native2ascii
\u5584\u826f
</pre>
</div>

<p>
java的properties文件不能有汉字，可以用<code>native2ascii</code>转成utf8写在文件中
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 替换war包中的文件</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<code>jar uf app.war WEB-INF/classes/application-online.properties</code> 替换文件，注意必须和war包中的文件保持相同路径
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 字符串</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 获取随机字符串</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-bash"># head -n 1024 /dev/urandom | md5sum
9b480cfa33d33009cbae5c0f10d7b2f7  -
</pre>
</div>

<p>
碰到需要随机数的场合，这是一个不错的方法
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> OpenSSL</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> HMAC</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-bash"># echo -n "initial text" | openssl dgst -sha1 -hmac "9b480cfa33d33009cbae5c0f10d7b2f7"
(stdin)= 32740bc521b8476818d7b7ba056ff7e758217adc
</pre>
</div>

<p>
可以用来检查编程结果的正确性
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: root</p>
<p class="date">Created: 2016-05-05 四 19:09</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
